Revit 2027 API
PDFExportOptions.SetExportInBackground Method
 Execute PDF export as a background process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExportInBackground(
	bool exportInBackground
)
Public Sub SetExportInBackground (
	exportInBackground As Boolean
)
public:
void SetExportInBackground(
	bool exportInBackground
)
member SetExportInBackground :
        exportInBackground : bool -> unit
Parameters
exportInBackground Boolean
 Execute PDF export as a background process.
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace